Tekla.Structures.Model.TaskDependency
The TaskDependency class represents a dependency between two task objects. Each task may depend
on many other tasks, but between two specific tasks only one type of a dependency may exist.
There are four types of dependencies:
FINISH_TO_FINISH (FF)
FINISH_TO_START (FS)
START_TO_FINISH (SF)
START_TO_START (SS)

Tekla.Structures.Model.TaskDependency.Lag
The lag of the task dependency represented in whole hours.

Tekla.Structures.Model.TaskDependency.Local
The locality indicates if the dependency was created in Tekla Structures and Task Manager or imported.

Tekla.Structures.Model.TaskDependency.Primary
The primary task of the task dependency.

Tekla.Structures.Model.TaskDependency.Secondary
The secondary task of the task dependency.

Tekla.Structures.Model.TaskDependency.DependencyType
The type of the task dependency.

Tekla.Structures.Model.TaskDependency.#ctor
Creates a new task dependency instance.

Tekla.Structures.Model.TaskDependency.#ctor(Tekla.Structures.Model.Task,Tekla.Structures.Model.Task)
Creates a new task dependency instance with the given primary and secondary tasks.
primary: The primary task to be used.
secondary: The secondary task to be used.
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
bool Result = false;
Task Task1 = new Task();
Task Task2 = new Task();
Task1.Name = "Default Task 0000";
Task2.Name = "Default Task 0001";
Task1.Insert();
Task2.Insert();
TaskDependency TaskDependency1 = new TaskDependency(Task1, Task2);
TaskDependency1.DependencyType = TaskDependency.DependencyTypeEnum.START_TO_FINISH;
Result = TaskDependency1.Insert();
}
}

Tekla.Structures.Model.TaskDependency.Insert
Inserts the task dependency instance in the model.
Returns: True on success.

Tekla.Structures.Model.TaskDependency.Select
Selects the task dependency instance from the model. The identifier must be set.
Returns: True on success.

Tekla.Structures.Model.TaskDependency.Modify
Modifies the task dependency instance in the model. The identifier must be set.
Returns: True on success.

Tekla.Structures.Model.TaskDependency.Delete
Deletes the task dependency instance from the model.
Returns: True on success.